src/cf/Catalogs/ВидыЗаказовПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыЗаказовПокупателей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользоватьДоставку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСостоянияЗаявки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеДоставлен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеОжидаетОтгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеОтгружен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПорядокСостояний</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ВидыОперацийЗаказПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийЗаказПокупателя</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПродажу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаряд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаПродажу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаЗаказНаряд</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ВидыЗаказовПокупателей/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для НомерСтроки = 1 По ПорядокСостояний.Количество() Цикл
		Для НомерСтрокиОстатка = НомерСтроки+1 По ПорядокСостояний.Количество() Цикл
			Если ПорядокСостояний[НомерСтроки-1].Состояние = ПорядокСостояний[НомерСтрокиОстатка-1].Состояние Тогда
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru='Дублируется состояние ""%1"" в строках %2 и %3'"), ПорядокСостояний[НомерСтроки-1].Состояние, НомерСтроки, НомерСтрокиОстатка),
					Ссылка,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ПорядокСостояний", НомерСтрокиОстатка, "Состояние"),
					,
					Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Данные = Новый Структура;
	Данные.Вставить("Ссылка", Ссылка);
	Данные.Вставить("СостояниеЗаявки", СостояниеЗаявки);
	Данные.Вставить("ПорядокСостояний", ПорядокСостояний);
	Данные.Вставить("СостояниеДоставлен", СостояниеДоставлен);
	Данные.Вставить("СостояниеОтгружен", СостояниеОтгружен);
	Данные.Вставить("СостояниеОжидаетОтгрузки", СостояниеОжидаетОтгрузки);
	Ответ = РаботаСЗаявками.ОбработкаПроверкиЗаполненияВидыЗаказа(Данные);
	Если Не Ответ.ИзменениеВозможно Тогда
		
		Отказ = Истина;
		ИспользоватьВиды = ПолучитьФункциональнуюОпцию("ИспользоватьВидыЗаказовПокупателей");
		
		ПараметрыМетода = Новый Структура;
		ПараметрыМетода.Вставить("РезультатПроверки", Ответ);
		ПараметрыМетода.Вставить("ИспользоватьВидыЗаказов", ИспользоватьВиды);
		ПараметрыМетода.Вставить("НаименованиеВидаЗаказа", Наименование);
		ПараметрыМетода.Вставить("ЗаявкиИспользуютсяДляВида", ЗначениеЗаполнено(СостояниеЗаявки));
		Ответ = РаботаСЗаявкамиКлиентСервер.ОбработатьРезультатПроверкиВозможностиИзмененияИспользованияЗаявокДляСостояния(
		ПараметрыМетода);
		
		Если ЗначениеЗаполнено(Ответ.ДанныеПредупреждения.Текст) Тогда
			ТекстСообщения = Ответ.ДанныеПредупреждения.Текст;
		Иначе
			ТекстСообщения = Ответ.ДанныеВопроса.Текст;
		КонецЕсли;
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТЧ = ПорядокСостояний.Найти(Справочники.СостоянияЗаказовПокупателей.Завершен, "Состояние");
	Если СтрокаТЧ = Неопределено Тогда
		СтрокаТЧ = ПорядокСостояний.Добавить();
		СтрокаТЧ.Состояние = Справочники.СостоянияЗаказовПокупателей.Завершен;
	Иначе
		ПорядокСостояний.Сдвинуть(СтрокаТЧ, ПорядокСостояний.Количество() - СтрокаТЧ.НомерСтроки);
	КонецЕсли;
	
	// Реквизит нужен только для оптимальных запросов, не нужно использовать его для работы с видом заказа напрямую
	НомерСостоянияЗаявки = Справочники.ВидыЗаказовПокупателей.НомерСостояния(ПорядокСостояний, СостояниеЗаявки);
	
	ЗаявкиИспользуются = РаботаСЗаявками.ЗаявкиИспользуются(,
	Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд);
	ДополнительныеСвойства.Вставить("ЗаявкиИспользовались", ЗаявкиИспользуются);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЗаявкиТеперьИспользуются = РаботаСЗаявками.ЗаявкиИспользуются(,
	Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу);
	
	ИспользованиеЗаявокИзменилось = (ДополнительныеСвойства.ЗаявкиИспользовались <> ЗаявкиТеперьИспользуются);
	Если ИспользованиеЗаявокИзменилось Тогда
		РаботаСЗаявками.ОчиститьОтборВСпискеЗаказов(
		Метаданные.Документы.ЗаказПокупателя.Формы.ФормаСписка.Имя);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
